Public Attributes | List of all members
API_CWFrameType Struct Reference
Element Manager
Represents a Curtain Wall Frame element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 short  | pen
For internal use.
 API_AttributeIndex  | material
Material index of the frame's surface.
 bool  | useOwnMaterial
The frame uses its own materials or materials defined in the library part (in case of GDL based frame).
 API_AttributeIndex  | buildingMaterial
Building Material of the frame.
 API_AttributeIndex  | cutLineType
Line index of the cut part of the frame on the floorplan.
 short  | cutLinePen
Pen index of the cut part of the frame on the floorplan.
 double  | d
Panel connection hole depth.
 double  | w
Panel connection hole width.
 double  | a1
Frame contour width inside. a1 and a2 are always equal and a1 + a2 = a on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
 double  | a2
Frame contour width outside. a1 and a2 are always equal and a1 + a2 = a on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
 double  | b1
Frame contour length inside. b1 = b - h on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
 double  | b2
Frame contour length outside. b2 = h on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
 double  | angle
Angle of the frame.
 API_CWFrameObjectTypeID  | objectType
Type of the frame.
 unsigned short  | connPriority
The priority of the frame in 3D intersections on a 1 to 19 scale.
 UInt32  | classID
The class identifier of the frame (previously known as category).
 API_Guid  | owner
The owner curtain wall.
 API_Guid  | symbolID
The related library part's object identifier.
 bool  | hasSymbol
True if the panel is a GDL object.
 bool  | deleteFlag
Flags a panel class for deletion. In this case, the panel's className should be the name of the class to substitute it with.
 bool  | defaultSubElem
Tells if this is the default panel for the curtain wall.
 UInt32  | segmentID
Identifier of containing segment.
 API_GridElemID  | cellID
The identifier of containing cell.
 API_Coord  | begRel
Relative first point in cell.
 API_Coord  | endRel
Relative second point in cell.
 API_Coord3D  | begC
First point of the frame's reference line.
 API_Coord3D  | endC
Second point of the frame's reference line.
 API_Coord3D  | orientation
Orientation of the frame. This vector is always perpendicular to the vector defined by begC and endC coordinates.
 UInt32  | joinedCWFramesBegCNum
Number of frames joined at begC.
 UInt32  | joinedCWFramesEndCNum
Number of frames joined at endC.
 UInt32  | assocCWPanelsNum
Number of associated panels - one frame border two panels.
 Int32  | libInd
Object Library Part index if the frame is GDL based.
 UInt32  | auxPanelDirsNum
Number of additional panel clamping vectors.
 Int32  | contourID
Contour ID for contour frames; other has invalid value.
 GS::uchar_t  | className [256]
Name of the frame's class.
Detailed Description
Represents a Curtain Wall Frame element.
Remarks
The Curtain Wall is a hierarchical (system) element consisting of Frame, Panel, Accessory and Junction components: these are the Members of the Curtain Wall, arranged on a Base Surface according to a pre-defined scheme.